petitions/app/views/petitions/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
      <td><%= link_to petition.title, "petitions/#{petition.id}" %></td>
      <td><%= petition.user.first_name + " " + petition.user.last_name %></td>