petitions/app/controllers/petitions_controller.rb

SELECT  "petitions".* FROM "petitions"  ORDER BY "petitions"."id" ASC LIMIT 1
SELECT "petitions".* FROM "petitions" WHERE "petitions"."user_id" = 2
---
  def index
    @petitions = Petition.all
    @petitions = @petitions.where(user: current_user) if params[:my]

SELECT  "petitions".* FROM "petitions" WHERE "petitions"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @petition = Petition.find(params[:id])

SELECT  "petitions".* FROM "petitions" WHERE "petitions"."user_id" = ? AND "petitions"."id" = ? LIMIT 1  [["user_id", 3], ["id", 25]]
---
  def edit
    @petition = current_user.petitions.find(params[:id])

SELECT  "petitions".* FROM "petitions" WHERE "petitions"."user_id" = ? AND "petitions"."id" = ? LIMIT 1  [["user_id", 2], ["id", 2]]
UPDATE "petitions" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "petitions"."id" = ?  [["title", "Петиция №9.1"], ["text", "Текст петиции номер девять и одна десятая"], ["updated_at", "2016-03-19 11:45:28.707031"], ["id", 25]]
---
  def update
    petition = current_user.petitions.find(params[:id])
    petition.update(petition_params)

INSERT INTO "petitions" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "5555666"], ["text", "555566"], ["user_id", 1], ["created_at", "2016-03-07 18:46:10.743236"], ["updated_at", "2016-03-07 18:46:10.743236"]]
---
  def create
    petition = current_user.petitions.create(petition_params)

SELECT  "petitions".* FROM "petitions" WHERE "petitions"."user_id" = ? AND "petitions"."id" = ? LIMIT 1  [["user_id", 3], ["id", 27]]
DELETE FROM "petitions" WHERE "petitions"."id" = ?  [["id", 1]]
---
  def destroy
    petition = current_user.petitions.find(params[:id])
    petition.destroy