petitions/app/controllers/sessions_controller.rb

  def create
    user = User.auth(params[:email], params[:password])
    if user
      session[:user_id] = user.id
      flash["alert-success"] = "Добро Пожаловать #{user.first_name}"
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "asd@asd"]]