petitions/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "password_salt" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_salt", "$2a$10$vAn1vbw8JgX7.rGMEqjB0."], ["password_hash", "$2a$10$vAn1vbw8JgX7.rGMEqjB0.qhVwlKsNAgTG326A0oMszn.UQsHBY4C"], ["updated_at", "2016-03-06 14:11:55.982757"], ["id", 1]]